# Scrubbing the data Step by Step

# This Project is incomplete : I will send it for marking once I am done

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
% matplotlib inline
import warnings
warnings.filterwarnings("ignore")

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
# Check shape of df
print(f'Data -  rows :' , df.shape[0] , 'columns :', df.shape[1])

Data -  rows : 5 columns : 4

In [5]:
# Check info of df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  3 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

In [6]:
# Check for nulls
df.isna().sum()

From_To         0
FlightNumber    2
RecentDelays    0
Airline         0
dtype: int64

In [7]:
# Make a copy of the df for later
df1 = df[:]

## [FlightNumber](#0) :

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [8]:
df1['FlightNumber'].iloc[np.where(df1['FlightNumber'].isnull())]  = \
[df1['FlightNumber'][x-1]+10 for x in np.where(df1['FlightNumber'].isnull())]

In [9]:
# Check result
df1.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [10]:
# Step1 - I decided to replace the "_" with "," for easy manipulation later
df1['From_To'] = df1['From_To'].apply(lambda x : x.replace("_" , ","))

In [11]:
# Check results
df1['From_To']

0        LoNDon,paris
1        MAdrid,miLAN
2    londON,StockhOlm
3      Budapest,PaRis
4     Brussels,londOn
Name: From_To, dtype: object

In [ ]:
# Cleaning the Destination Columns
new_col = [col.upper() for col in df['From_To']]
df['From_To'] = new_col

In [ ]:
# Check results
df.head()

# <a id='7'>Step 2 -  I create a function to Split the names of the Cities<a/>

In [12]:
def get_city(city_name):
    return city_name.split(',')[1]

In [13]:
df1["Arrival"] = df1['From_To'].apply(lambda x: get_city(x))

In [14]:
df1.head()

,From_To,FlightNumber,RecentDelays,Airline,Arrival
0,"LoNDon,paris",10045.0,"[23, 47]",KLM(!),paris
1,"MAdrid,miLAN",10055.0,[],<Air France> (12),miLAN
2,"londON,StockhOlm",10065.0,"[24, 43, 87]",(British Airways. ),StockhOlm
3,"Budapest,PaRis",10075.0,[13],12. Air France,PaRis
4,"Brussels,londOn",10085.0,"[67, 32]","""Swiss Air""",londOn

In [15]:
# Split the cities from the column
df1['From_To'] = df1['From_To'].apply(lambda x: x.split(",")[0].split('/')[0])

In [16]:
# Check result
df1.head()

    From_To  FlightNumber  RecentDelays              Airline    Arrival
0    LoNDon       10045.0      [23, 47]               KLM(!)      paris
1    MAdrid       10055.0            []    <Air France> (12)      miLAN
2    londON       10065.0  [24, 43, 87]  (British Airways. )  StockhOlm
3  Budapest       10075.0          [13]       12. Air France      PaRis
4  Brussels       10085.0      [67, 32]          "Swiss Air"     londOn

### [From_To Column](#0)
3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [ ]:
# df1 = df.copy()

In [17]:
new_1 = [col.capitalize() for col in df1['From_To']]
df1['From_To'] = new_1

In [18]:
new_2 = [col.capitalize() for col in df1['Arrival']]
df1['Arrival'] = new_2

In [19]:
# Check results
df1

    From_To  FlightNumber  RecentDelays              Airline    Arrival
0    London       10045.0      [23, 47]               KLM(!)      Paris
1    Madrid       10055.0            []    <Air France> (12)      Milan
2    London       10065.0  [24, 43, 87]  (British Airways. )  Stockholm
3  Budapest       10075.0          [13]       12. Air France      Paris
4  Brussels       10085.0      [67, 32]          "Swiss Air"     London

### [Rename the columns](#0)

In [20]:
df1.rename(columns = {'From_To' : 'Departure' })

  Departure  FlightNumber  RecentDelays              Airline    Arrival
0    London       10045.0      [23, 47]               KLM(!)      Paris
1    Madrid       10055.0            []    <Air France> (12)      Milan
2    London       10065.0  [24, 43, 87]  (British Airways. )  Stockholm
3  Budapest       10075.0          [13]       12. Air France      Paris
4  Brussels       10085.0      [67, 32]          "Swiss Air"     London

# <a id='7'>Cleaning The Airline Column<a/>

In [21]:
# Lets check the airline column to see what we are dealing with here
df1['Airline']

0                 KLM(!)
1      <Air France> (12)
2    (British Airways. )
3         12. Air France
4            "Swiss Air"
Name: Airline, dtype: object

In [22]:
col = ['Airline']
df1[col]=df1[col].replace({'$':'','(!)':"",'<':"",'>':"",'( )':"",'12.':"",' ':"",'""':"","": "",' (12)':"","()":""}
                          ,regex = True)

In [23]:
df1['Airline'] = df1['Airline'].apply(lambda x : x.strip('()'))

In [24]:
df1['Airline'] = df1['Airline'].apply(lambda x : x.strip('.'))

In [25]:
df1['Airline'][4] = 'SwissAir'

In [26]:
# Check results
df1.head()

    From_To  FlightNumber  RecentDelays         Airline    Arrival
0    London       10045.0      [23, 47]             KLM      Paris
1    Madrid       10055.0            []       AirFrance      Milan
2    London       10065.0  [24, 43, 87]  BritishAirways  Stockholm
3  Budapest       10075.0          [13]       AirFrance      Paris
4  Brussels       10085.0      [67, 32]        SwissAir     London

In [ ]:
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [27]:
df2 = pd.DataFrame(df1['RecentDelays'].values.tolist())
df2

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

### [Rename the columns](#0)

In [28]:
try:
    df2.rename(columns = {0:'Delays_1', 1:'Delays_2', 2:'Delays_3'} , inplace = True)
    
except Exception as x:
    pass

In [29]:
# Check results
df2

   Delays_1  Delays_2  Delays_3
0      23.0      47.0       NaN
1       NaN       NaN       NaN
2      24.0      43.0      87.0
3      13.0       NaN       NaN
4      67.0      32.0       NaN

In [ ]:
# df4 = df.copy()

In [30]:
df1[['Delays_1','Delays_2','Delays_3']] = df2[['Delays_1','Delays_2','Delays_3']]

In [31]:
df1

,From_To,FlightNumber,RecentDelays,Airline,Arrival,Delays_1,Delays_2,Delays_3
0,London,10045.0,"[23, 47]",KLM,Paris,23.0,47.0,NaN
1,Madrid,10055.0,[],AirFrance,Milan,NaN,NaN,NaN
2,London,10065.0,"[24, 43, 87]",BritishAirways,Stockholm,24.0,43.0,87.0
3,Budapest,10075.0,[13],AirFrance,Paris,13.0,NaN,NaN
4,Brussels,10085.0,"[67, 32]",SwissAir,London,67.0,32.0,NaN

# <a id='7'># Finally lets drop the RecentDelays Columns<a/>

In [32]:
df1.drop('RecentDelays' , 1, inplace = True)

In [33]:
df1

,From_To,FlightNumber,Airline,Arrival,Delays_1,Delays_2,Delays_3
0,London,10045.0,KLM,Paris,23.0,47.0,NaN
1,Madrid,10055.0,AirFrance,Milan,NaN,NaN,NaN
2,London,10065.0,BritishAirways,Stockholm,24.0,43.0,87.0
3,Budapest,10075.0,AirFrance,Paris,13.0,NaN,NaN
4,Brussels,10085.0,SwissAir,London,67.0,32.0,NaN

# Note from here we can decide to drop the NAn values or fill them with zero or with the mean or median